from linear_system import LinearSystem
from matrix_generators import diag, terdiag, hilbert, rand
import pandas as pd

def print_ls(A, b):
    print('\nA =')
    for row in A:
        print(row)
    print('\bb =')
    for row in b:
        print(row)

# Функция тестирования:
# linear_system - СЛАУ
# eps_list - список степеней рассматриваемых погрешностей
# seed - зерно генератора случайных чисел
def testing(linear_system, eps_list, seed = 42):
    # Печать матрицы A и правой части b
    # (закомментировано, т.к. занимает много места и несёт мало информации)
    #print_ls(linear_system.A, linear_system.b)
    #_A, _b = linear_system.variate(42, eps_list[0])
    #print_ls(_A, _b)

    print('\nЗначения критериев обусловленности:')
    print('cond_s =', round(linear_system.cond_s(), 6))
    print('cond_v =', round(linear_system.cond_v(), 6))
    print('cond_a =', round(linear_system.cond_a(), 6))

    diff = []
    for eps in eps_list:
        _, var = linear_system.solve_compare(seed, eps)
        diff.append([var])

        _A, _ = linear_system.variate(42, eps)
        print(f'\nЗначения критериев обусловленности (при eps = 10^(-{eps})):')
        print('cond_s =', round((LinearSystem(_A)).cond_s(), 6))
        print('cond_v =', round((LinearSystem(_A)).cond_v(), 6))
        print('cond_a =', round((LinearSystem(_A)).cond_a(), 6))
    
    diff = pd.DataFrame(diff)\
        .rename(columns={0: "|x - x'|"})\
        .set_axis([f'e = 10^(-{eps})' for eps in eps_list], axis=0)

    print('\nНевязка при разных погрешностях:')
    print(diff)
    print('\n----------------------------------------------------------------------')
    

# ТЕСТЫ
if __name__=='__main__':
    # Матрица со случайными значениями
    print('\n\tМатрица со случайными значениями')
    ls = LinearSystem(rand(20))
    testing(ls, [3, 6, 9])

    '''
            Матрица со случайными значениями

    Значения критериев обусловленности:
    cond_s = 203.827922
    cond_v = 2480812370.345762
    cond_a = 20.251026

    Невязка при разных погрешностях:
                |x - x'|
    e = 10^(-3)  1.387771
    e = 10^(-6)  0.009263
    e = 10^(-9)  0.010344
    '''

    # Диагональная матрица
    print('\n\tДиагональная матрица')
    ls = LinearSystem(diag(20))
    testing(ls, [3, 6, 9])

    '''
        Диагональная матрица

    Значения критериев обусловленности:
    cond_s = 92.667662
    cond_v = 1.0
    cond_a = 1.0

    Невязка при разных погрешностях:
                |x - x'|
    e = 10^(-3)  2.858090
    e = 10^(-6)  0.230576
    e = 10^(-9)  0.226404
    '''
    
    # Матрицы Гильберта порядка 4, 7 и 10:
    for dim in [4, 7, 10]:
        print(f'\n\tМатрица Гильберта (порядка {dim})')
        ls = LinearSystem(hilbert(dim))
        testing(ls, [3, 6, 9])

    '''
        Матрица Гильберта (порядка 4)

    Значения критериев обусловленности:
    cond_s = 15613.79356
    cond_v = 937085.871608
    cond_a = 4020.913453

    Невязка при разных погрешностях:
                |x - x'|
    e = 10^(-3)  12.717187
    e = 10^(-6)   4.124206
    e = 10^(-9)   4.104035

    ----------------------------------------------------------------------

        Матрица Гильберта (порядка 7)

    Значения критериев обусловленности:
    cond_s = 481747253.692991
    cond_v = 1.4210002976101978e+22
    cond_a = 71621856.843477

    Невязка при разных погрешностях:
                    |x - x'|
    e = 10^(-3)  1004.101853
    e = 10^(-6)  1514.150771
    e = 10^(-9)  1531.365092

    ----------------------------------------------------------------------

        Матрица Гильберта (порядка 10)

    Значения критериев обусловленности:
    cond_s = 16333640022240.15
    cond_v = 7.245599940259725e+48
    cond_a = 1719867690895.7766

    Невязка при разных погрешностях:
                    |x - x'|
    e = 10^(-3)   34934.891483
    e = 10^(-6)  312171.062235
    e = 10^(-9)  394904.829418
    '''

    # Трёхдиагональная (плохая) матрица
    print(f'\n\tТрёхдиагональная (плохая) матрица')
    ls = LinearSystem(terdiag(12))
    testing(ls, [2, 4, 6, 8])

    '''
        Трёхдиагональная (плохая) матрица

    Значения критериев обусловленности:
    cond_s = 150.133274
    cond_v = 2990.769231
    cond_a = 16.571523

    Невязка при разных погрешностях:
                |x - x'|
    e = 10^(-2)  3.384978
    e = 10^(-4)  2.269839
    e = 10^(-6)  1.814569
    e = 10^(-8)  1.808218
    '''

    # Трёхдиагональная матрица с диагональным преобладанием
    print(f'\n\tТрёхдиагональная матрица с диагональным преобладанием')
    ls = LinearSystem([
        [5, 1, 0, 0, 0, 0],
        [1, 5, 2, 0, 0, 0],
        [0, 2, 5, 1, 0, 0],
        [0, 0, 1, 5, 2, 0],
        [0, 0, 0, 2, 5, 1],
        [0, 0, 0, 0, 1, 5]
    ])
    testing(ls, [2, 4, 6, 8])

    '''
        Трёхдиагональная матрица с диагональным преобладанием

    Значения критериев обусловленности:
    cond_s = 8.428451
    cond_v = 2.483022
    cond_a = 1.558621

    Невязка при разных погрешностях:
                |x - x'|
    e = 10^(-2)  0.257165
    e = 10^(-4)  0.013584
    e = 10^(-6)  0.011120
    e = 10^(-8)  0.011096
    '''

    # Матрицы из методички А.Н.Пакулиной
    print(f'\n\tМатрица 1 из методички А.Н.Пакулиной')
    ls = LinearSystem([
        [-401.98, 200.34], 
        [1202.04, -602.32]
    ])
    testing(ls, [2, 4, 6, 8])

    '''
        Матрица 1 из методички А.Н.Пакулиной

    Значения критериев обусловленности:
    cond_s = 1541.079515
    cond_v = 463.12312
    cond_a = 463.12312

    Невязка при разных погрешностях:
                |x - x'|
    e = 10^(-2)  0.045492
    e = 10^(-4)  0.009252
    e = 10^(-6)  0.008904
    e = 10^(-8)  0.008901
    '''

    print(f'\n\tМатрица 2 из методички А.Н.Пакулиной')
    ls = LinearSystem([
        [-402.90, 200.70],
        [1204.20, -603.60]
    ])
    testing(ls, [2, 4, 6, 8])

    '''
        Матрица 2 из методички А.Н.Пакулиной

    Значения критериев обусловленности:
    cond_s = 1338.002985
    cond_v = 402.200049
    cond_a = 402.200049

    Невязка при разных погрешностях:
                |x - x'|
    e = 10^(-2)  0.039150
    e = 10^(-4)  0.008005
    e = 10^(-6)  0.007705
    e = 10^(-8)  0.007702
    '''
